**SQLite Practice 2**


Steps Performed:
1) Checked data base for tables present. 
2) Connected to snakes.
3) Inserted a row of data to table. 
4) Inserted 2 new rows of data using executemany. 
5) Made updates to table (execute many).
6) Opened as Dataframe and added a column.
7) Saved as table in sqlite database replacing old table. 
8) Verified if changes were made.

In [1]:
import sqlite3 as db 
import pandas as pd

In [2]:
con= db.connect("MY_DATABASE")
cur= con.cursor()

In [3]:
cur.execute("SELECT name from sqlite_master WHERE type ='table';" )
print(cur.fetchall())

[('Snakes',)]

In [4]:
cur.execute("SELECT * FROM Snakes")
print(cur.fetchall())

[(1, 'Spectacled Cobra', 1), (2, 'Rat Snake', 0), (3, 'Indian Rock Python', 0), (4, 'Saw Scaled Viper', 1), (5, "Russele's Viper", 1), (6, 'Chequred Keelback', 0)]

In [6]:
cur.execute("INSERT into Snakes VALUES(7, 'Common Krait', 1)")
con.commit()

In [7]:
#Checking if new data's ID is inserted
cur.execute("SELECT ID FROM Snakes")
print (cur.fetchall())

[(1,), (2,), (3,), (4,), (5,), (6,), (7,)]

In [8]:
# Inserting two new snakes:
new_snakes = [(9, "Green Vine Snake", 0), (10, "Trinket Snake", 1)]

In [11]:
cur.executemany("INSERT into Snakes Values(?,?,?)", new_snakes)

In [12]:
con.commit()

In [14]:
#Verifying if data was added 
cur.execute("SELECT * from Snakes")
print(cur.fetchall())

[(1, 'Spectacled Cobra', 1), (2, 'Rat Snake', 0), (3, 'Indian Rock Python', 0), (4, 'Saw Scaled Viper', 1), (5, "Russele's Viper", 1), (6, 'Chequred Keelback', 0), (7, 'Common Krait', 1), (9, 'Green Vine Snake', 0), (10, 'Trinket Snake', 1)]

In [16]:
#replacing ID of last two rows in table.
IDerrors= [(8, "Green Vine Snake"), (9, "Trinket Snake")]
cur.executemany("UPDATE Snakes SET ID= ? where Species= ?", IDerrors)
con.commit()

In [18]:
cur.execute("SELECT ID FROM Snakes")
print(cur.fetchall())

[(1,), (2,), (3,), (4,), (5,), (6,), (7,), (8,), (9,)]

In [20]:
# Changing Trinket Snake to non venomous:
cur.execute("UPDATE Snakes SET Venomous= 0 WHERE ID=9")
con.commit()

In [22]:
snakesdf=pd.read_sql_query("select * from Snakes", con)

In [23]:
snakesdf

   ID             Species  Venomous
0   1    Spectacled Cobra         1
1   2           Rat Snake         0
2   3  Indian Rock Python         0
3   4    Saw Scaled Viper         1
4   5     Russele's Viper         1
5   6   Chequred Keelback         0
6   7        Common Krait         1
7   8    Green Vine Snake         0
8   9       Trinket Snake         0

In [61]:
cur.close()
con.close()

In [74]:
found=["Yes","Yes","No","Yes","No","Yes","Yes","Yes","Yes"]
snakesdf["Found In Bangalore"]= found

In [76]:
snakesdf=snakesdf.set_index("ID")

In [77]:
con=db.connect("MY_DATABASE")
snakesdf.to_sql("Snakes",con,if_exists="replace")

/home/siddharth/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py:2882: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [78]:
cur=con.cursor()
con.commit()

In [79]:
cur.execute("SELECT * from Snakes")
cur.fetchall()

[(1, 'Spectacled Cobra', 1, 'Yes'),
 (2, 'Rat Snake', 0, 'Yes'),
 (3, 'Indian Rock Python', 0, 'No'),
 (4, 'Saw Scaled Viper', 1, 'Yes'),
 (5, "Russele's Viper", 1, 'No'),
 (6, 'Chequred Keelback', 0, 'Yes'),
 (7, 'Common Krait', 1, 'Yes'),
 (8, 'Green Vine Snake', 0, 'Yes'),
 (9, 'Trinket Snake', 0, 'Yes')]

In [80]:
cur.close()
con.close()